chat_system_71525728_actor_description=Frog Feanora. Frog.
chat_system_71525728_snap_0_question=^?^I am sure that all the girls who were enchanted by the earl have turned into frogs again. Surely he will not keep them at his side; probably he will hide them somewhere away from people's eyes. Would you go and find out what is going on in that castle, and return my sisters to the swamp. 
chat_system_71525728_snap_0_answer_0=^?^Interesting. All right, I'll ask Argus about your sisters.
chat_system_71525728_snap_1_question=^?^Well, how is everything going? Have you managed to free my sister-frogs from the cruel Earl Argus?
chat_system_71525728_snap_1_answer_0=^?^Not yet, my green queen. I'll be back.
chat_system_71525728_snap_1_answer_1=^?^Yes, I brought them. Here are your sisters.
chat_system_71525728_snap_2_question=^?^Excellent! Croak! How wonderful it is that there are such kind and sympathetic people as yourself, knight. If there were a man who was truly able to perform the miraculous transformation, it would be you.<br>I promised to give the most precious thing I have as a reward. And that most precious thing is my love.<br>If love and faith in miracles are also alive in you, then kiss me and I will transform into a beautiful girl, and become your wife. But remember, if your feelings fade, I will turn back into a frog again. Croak!
chat_system_71525728_snap_2_answer_0=^?^Excellent! I have always dreamed of a magic wife. (Kiss the frog.)
chat_system_71525728_snap_2_answer_1=^?^Oh, that is very nice. Thank you for your offer, but I'm afraid I'll need to think about it.
